// // Задача 13. программа принимает пятизначное число и проверяет, является ли оно палиндромом

// string num = Convert.ToString(Console.Readline());

// if (num[0]==num[4]&&num[1]==num[3])
// {
//     Console.Writeline("Палиндром");
// }
// else
// {
//    Console.Writeline("Не палиндром"); 
// }


// // Задача 21. программа принимает координаты двух точек в 3д пространстве и ищет расстояние между ними

// Console.Writeline("ВВедите координату X для первого числа");
// int x1 = Convert.ToInt32(Console.Readline());

// Console.Writeline("ВВедите координату Y для первого числа");
// int y1 = Convert.ToInt32(Console.Readline());

// Console.Writeline("ВВедите координату Z для первого числа");
// int z1 = Convert.ToInt32(Console.Readline());

// Console.Writeline("ВВедите координату X для второго числа");
// int x2 = Convert.ToInt32(Console.Readline());

// Console.Writeline("ВВедите координату Y для второго числа");
// int y2 = Convert.ToInt32(Console.Readline());

// Console.Writeline("ВВедите координату Z для второго числа");
// int z2 = Convert.ToInt32(Console.Readline());

// double len = Math.Sqrt(Math.Pow((x2-x1),2)+Math.Pow((y2-y1),2)+Math.Pow((z2-z1),2));

// Console.Writeline(len);

// // Задача 23. Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.

// int num = Console.Writeline();
// for (i=1;i<=num,i++)
// {
//     int cube = Math.Pow(i,3);
//     console.Writeline(cube);
// }
